/**
 * Created by shanfubao on 2016/11/29.
 */
/**
 * Created by shanfubao on 2016/11/29.
 */
$(function(){
    //审核客服日工作情况表——柱形图
    var data1 = [1280,640,1320,1500,870,690,830,960,1024,1500,1280,640,1320,1500,870,690,830,960,1024,800,1280,640,1320,1500,870,690,830,960,600,900];
    var data2 = [780,540,1420,1300,800,900,700,960,1050,1300,780,540,1420,1300,800,900,700,960,1050,800,780,540,1420,1300,800,900,700,960,1050,800];
    var canvas = $("#myChart")[0];
    var context = canvas.getContext("2d");
    context.font ="20px Microsoft YaHei";
    var chartData = {
        labels : ["10/01","10/02","10/03","10/04","10/05","10/06","10/07","10/08","10/09","10/10",
            "10/11","10/12","10/13","10/14","10/15","10/16","10/17","10/18","10/19","10/20",
            "10/21","10/22","10/23","10/24","10/25","10/26","10/27","10/28","10/29","10/30"],
        datasets : [{
            label : "审核人数",
            backgroundColor : "#438ac9",
            data : data1
        },{
            label:"通过人数",
            backgroundColor:"#7dcef4",
            data:data2
        }
        ]
    };

    new Chart(context,{
        type : "bar",
        data : chartData,
        options : {
            elements: {
                rectangle: {
                    borderWidth: 2,
                    borderSkipped: 'bottom'
                }
            }
        }
    });
    //会员审核日通过情况分布表——曲线图
    var ctx = $("#myChart1").get(0).getContext("2d");
    var data = {
        labels : ["10/01","10/02","10/03","10/04","10/05","10/06","10/07","10/08","10/09","10/10",
            "10/11","10/12","10/13","10/14","10/15","10/16","10/17","10/18","10/19","10/20",
            "10/21","10/22","10/23","10/24","10/25","10/26","10/27","10/28","10/29","10/30"],
        datasets : [
            {
                label:"一次通过",
                fillColor : "transparent", // 背景色
                strokeColor : "#ef7c1f", // 线
                pointColor : "#ef7c1f", // 点
                pointStrokeColor : "#fff", // 点的包围圈
                scaleFontSize : 18,
                scaleShowLabels : true,
                scaleLabel : "<%=value%>",
                scaleLineColor : "rgba(0,0,0,.1)",
                data : [78,50,20,10,80,90,70,96,10,10,70,50,40,10,80,10,13,45,59,89,23,40,12,56,23,94,86,96,10,80]
            },
            {
                label:"二次通过",
                data : [18,28,13,19,86,27,9,50,20,10,80,90,70,96,10,10,70,50,40,10,80,10,13,45,23,40,12,56,50,40]
            },
            {
                label:"三次及以上通过",
                data : [28,48,19,96,40,27,100,80,10,13,45,59,89,23,40,12,56,23,94,86,96,10,80,10,70,50,40,10,80,10]
            },
            {
                label:"未通过",
                data : [48,30,76,27,19,28,20,28,48,19,96,40,27,100,80,10,13,45,59,89,23,40,12,56,23,94,86,96,10,80]
            }
        ]
    };
    new Chart(ctx,{
        type : "line",
        data : data,
        options : {
            elements: {
                rectangle: {
                    borderWidth: 2,
                    borderSkipped: 'bottom'
                }
            }
        }
    });
});